{
    "aries": "You will have positive momentum in your career however, but the impact of Mars will test your skills and patience. If you are in business, you may have many positive ideas within you but, your confidence may keep fluctuating at times.\n\nThe impact of Jupiter will make you optimistic about future prospects. However, you may need to accept new challenges, suggests Mercury.\n\nThe impact of South Node can hold you from accelerating the pace of progress. Mars will make this latter part of this month eventful for you on the career front.\n\nThis can be an important month for your financial planning. Check and recheck your investments before making any vital decisions.\n\nAlso, check on contracts that can legally bind you. Reassess your strategies, stop carried away by soft options.\n\nHowever, expect a good amount of income under the benefic influence of Venus during the latter part of this month. At relationship front, Venus will pour blessings and you may be getting extravagant with your feelings.\n\nIt is time to look for fun, unusual and funny topics to talk over with friends, your mate. During the latter part of this month, there will be some disturbances along with some glorious romantic time.\n\nThe month will remain favorable for your health and if you have been suffering from any health problems, road to recovery will be on the cards. Mars indicates that hectic life will take a toll on your body.\n\nYou will have to take some time off your busy to balance your mental and physical health. In your studies, you will have good planetary support hence you may succeed in examinations as per your desires.\n\nYour performance may improve and you may regain some of the lost ground during this month. Instead of theoretical knowledge, you are likely to improve your other skills and practical knowledge.",
    "taurus": "The month may begin with some disruptions as Mercury may bring some differences with your associates but the gradually it may bring a lot of energy. It will help you to improve your financial status.\n\nThe combined impact of Venus and Mercury suggest that your positive attitude will help you attract your beloved. Your intuition will lead you to do the right things in your studies.\n\nAs the month advances, Jupiter will bring some new opportunities your way. This phase is likely to be favorable for making some important moves particularly if you are doing business.\n\nThe impact of planets indicates stable profits, including investments or passive income. Planets may force you to focus on improving your habits and switching to a healthier lifestyle.\n\nMercury indicates that the latter half of this month can be the perfect time to really make a statement with your skills. However, you are likely to face some unexpected issues.\n\nSo you need to stop thinking big and start dealing with some of the routine details. Mars can bring a turbulent phase in relationship.\n\nGradually, you will see a shift towards holistic approach for physical and mental well-being. Jupiter will help you to get some opportunities for progress in your job or business during the latter part.\n\nBut, rash decisions may land you in troubles, indicates Mars. Also, some stress related health problems cannot be avoided.\n\nYour studies may hamper as many other things happening in your life. Mercury indicates that the beginning of a new chapter in your career around the month end.\n\nIf you are currently not involved in a relationship, there are good chances that Venus will bless you to find someone. The impact of Mars will inspire you to become more physically active.\n\nYou will also have support of your luck in the matters related to your studies..",
    "gemini": "As the month begins, Mercury will bring positive momentum and likely to be favorable for making some important career moves. Change is in the air, if you are doing business.\n\nIf you are bided by financial issues, then you should unleash your smart ideas and try to generate more gains from those ideas. The impact of Mercury may keep you in good cheer and improved health status as well as improvement in your studies.\n\nAs the month advances, you will have the energy and practicality to make big strides, and due to the ample support of Mercury your planning can be just as brilliant particularly if you are doing business. North node may however provoke you to take some ambitious steps but you will require to maintain a balance in your financial planning.\n\nSaturn will force you to accept some facts in your relationship matters. The latter half of this month will help you doing well in your job and will be extra sharp when it comes to take any vital decisions.\n\nBut around the end of this month you may have too much going on at your work place to get caught up in lengthy discussions that go nowhere. Gradually, you will start feeling financially secure and stable too but you will need good financial management.\n\nVenus will make you full of love that you will not be able to stop yourself from celebrating the good moments around the month end. This can be a hectic phase hence you need to adjust your lifestyle so that you can improve on the health status.\n\nYou may gain positive remarks for your performance in your studies. Still, a sense of dissatisfaction may keep bothering you as the month reaches its end.",
    "cancer": "In the beginning of this month, you may feel blocked at your work place. Try to think big, with a perspective for the future.\n\nMercury may also affect your financial status to quite an extent. Venus may bring amazing harmony in your love life and relationship matters.\n\nThe month may begin with some negative planetary influences for your health status. As the month advances, Mars will help you to resist any competition at your work place.\n\nTo protect your interests, don’t argue with your boss. North Node may make over ambitious and force you to take undue risk which can be very disruptive for your financial planning.\n\nYour interactions may become disruptive if you lose control over your emotions and temperament under the influence of Mars. You will have good planetary support and if you show your skills and talents to your mentors, you may have a better scope for growth in your studies during the latter half of this month.\n\nIt is likely to help you to improve your health status as well. Also, it will be favorable for money flow for the majority of time.\n\nYou need to act with patience in matters related to love and relationship as rushing to the conclusion under the influence of Mars may cause problems in the long run. Some problems in health are possible, perhaps mostly due to some worry and stress.\n\nAround the month end, don’t overload yourself, just plan efficiently and you will see better results in your career. You will have good inflow of money but all important dealings should not be undertaken due to complex energies of North Node.\n\nVenus may boost your prospects in the areas of romance. Your education is going to be blessed by the favourable impact of Jupiter.\n\nThis can be a good phase for your overall health as well.",
    "leo": "As the month begins, Jupiter will make you able to strengthen your position in your career. If you are in business, boldly move forward without wasting time on unnecessary thoughts.\n\nYou are expected to get many favorable opportunities for financial gains. But Venus indicates that some misunderstandings may develop at this time.\n\nMercury will demand you to focus on self-study and analyze your progress till date. As the month advances, the impact of Mercury will help you cope with any difficulties and large volumes of work.\n\nIt may bring you some good earning opportunities, but it is important to consult an expert advisor before making any major deals or investment. Saturn may make you feel blocked in relationship.\n\nLet this period pass. The period around the mid of this month may help you to clear the air of uncertainties.\n\nWith a bit of extra efforts and perseverance, you can make progress in whatever you set your mind to in your studies. Your positive outlook towards your work and career goals may result in success during the latter half of month with the help of Jupiter’s blessings.\n\nYou can look forward to new projects if you are in business. Saturn will require you to maintain a positive attitude, patience, and also do your research to meet your career goals.\n\nThis phase may bring some good financial opportunities and growth potential for you. It will be a mixture of both good and bad events in your love relationship.\n\nThere will be some fierce agreements and disputes with your beloved as a result of Mars’ impact. Stars will help you to improve the condition of your health.\n\nAround the month end, unexpected expenses may put a strain on your finances, indicates North Node. Jupiter could prove to be a blessing for your studies.\n\nThis phase may bring harmonious impact on your health.",
    "virgo": "You will look to get some encouraging opportunities in the beginning of this month. A good opportunity will come your way but don’t expect immediate results.\n\nThe impact of North Node can be tricky hence you must refrain from making any new investments or promise financial involvement at this time. You will have to make conscious efforts to maintain cordial relations with your beloved ones as one or the other issue may keep bothering you this time around.\n\nThe beginning of this week is going to be a little tedious for your studies. After some fluctuations in your health in the beginning, you will realize coming back to normal health.\n\nThe combined impact of Mercury and Venus shall facilitate encouraging gains as the month advances. In spite of an increase in earnings and spare funds, you are likely to face problems in saving enough due to more expenses.\n\nThe period around the mid of this month can be a very important and sensitive phase of your love life. North Node can be damaging.\n\nMercury will make you able to envisage a coming opportunity, from mid of the month onwards. But Mars indicates possible glitches in the financial matters.\n\nSo, be extremely vigilant when it comes to financial matters. Conditions may begin to improve gradually.\n\nYour romantic bond may suffer a major blow due to the impact of North Node. Jupiter may bring ease of working in your job around the month end.\n\nBusiness prospects look encouraging but, business partnerships shall demand taking tough decisions. You may receive good planetary support to enhance your financial strength.\n\nValuable guidance and tips of your mentors may help you to score well in your studies. Your health status may remain good but it may make you somewhat careless which might affect your fitness level.",
    "libra": "As the month begins, you will be able to make some action-oriented plans. As the days go by you will be clearer about how to achieve your goals and hence the pace of your financial progress is likely to start picking positive momentum.\n\nRefrain from reacting, driven by emotions. Otherwise, Mars may unnecessarily disrupt the harmony of your relationship, Lack of concentration may affect your performance but, you may soon realize your mistakes and may be able to recover your lost ground in your studies.\n\nAs the month advances, Saturn will demand more efforts. If you are already working on some critical projects, you need to get ready to face a tough time around the middle of this month.\n\nMercury suggests that you may need to review financial plans in order to enhance your financial strength. During the latter half, you will face some challenges at your work place due to the impact of South Node.\n\nThe positivity of Venus is likely to bring happiness in your love life during the latter part of this month. Mercury will make you able to find new ways of learning and communicating or new systems of knowledge.\n\nBut your health may get disturbed and you may have a lack of appetite which may result in weakness. If you are doing business, you must not make any hasty moves to expand the business around the month end.\n\nThe impact of Venus will bring love in your life and if you are in committed relationship, this could the phase to take the relationship to the next level. You will be making all the efforts on increasing your fitness level and that is likely to lead you towards a more stable and healthy lifestyle as the month approaches its end.",
    "scorpio": "At career front, you may feel much more supported as the month begins. If you are doing business, Mercury may demand you to take decision-related to major financial involvement after due deliberation.\n\nThis could be a good time to invest in land or property. You and your beloved are likely to enjoy your fair share of love due to the blessings of Venus.\n\nYour fortune will support you to a greater extent in your studies. But as the month advances, the impact of South Node may bring challenging time at your work place.\n\nMercury will eventually help you to manage the challenges efficiently. Venus may lead to an increase in positive energy, love, romance and intimacy around the mid of this month.\n\nDuring the latter part of this month you can expect better results as well. It will grant you good results for your health and fitness.\n\nYou will witness positive change in your life style. The impact of Jupiter may bring new opportunities for progress in your career.\n\nVenus indicates that you will enjoy some wonderful moments with your beloved ones, friends and family. You will be able to focus on your academics and you should fare well in your examination due to Mercury’s support.\n\nSome daily stress can make you feel tired or low energy at times. The favourable impact of Jupiter may help you so around the month end your financial goal will be achieved with efficient handling of your resources.\n\nBut the period around the month end is going to bring in a lot of disturbance in your studies. Your health status is likely to improve as you will be much more spirited and motivated around the month end.",
    "sagittarius": "In the beginning of this month, due to the impact of shadow planets, you are likely to face some fresh challenges and you may require hard and sustained efforts to get desired success in your career. Venus would bring some moments of amusement and bliss in your love life.\n\nMercury may make you able to grasp complicated subjects very efficiently which may help you to make progress in your studies. There will be some periods in the beginning which might make you uncomfortable with your health and fitness level.\n\nIf you are doing business, you may expect to get some good news regarding some pending deals around the mid of this month. However, it will not be smooth sailing as Saturn may force you to work hard to achieve what you have set out to.\n\nThere may be gradual improvement in your relationship and greater clarity now. A lots of positive energy of Jupiter may help you make good progress in your education.\n\nIt may also help you improve your stamina and fitness. Mercury will make you able to handle resources efficiently and likely to empower your strength during the latter half.\n\nYou will earn good rewards and appreciations for your creativity. Better support of luck shall help you to strengthen your financial status You may have ample planetary support but carelessness or some misunderstandings created by Mars may make your relationship vulnerable.\n\nSouth Node is going to bring in a lot of disturbance n your studies. Jupiter will enhance your vitality during this week however, as the month progresses it may also make prone to some health problems.\n\nYour financial position would stay satisfying and there will be an addition in wealth around the month end. Due to the impact of Mars, some deep rooted feelings both passionate and somewhat stressful, could come to fore strongly.\n\nMercury may help you creating a strong positive environment to expand your knowledge base.",
    "capricorn": "Due to the favourable impact of Mars and Venus, things shall start picking up as the month begins. But you must refrain from making any new investments or promise a financial involvement at this time.\n\nDue to the impact of North Node, your interactions with your beloved ones may become somewhat difficult, It will be a time to review your past performance and to make necessary modifications in order to achieve better results in your studies. There will be some periods in the beginning of this month which might make you uncomfortable with your health and fitness level.\n\nAround the mid of this month, South Node may bring some obstacles and bottlenecks as well hence you cannot expect smooth sailing in your career. If you are doing business, you may also need to review plan during this phase.\n\nSaturn indicates some unexpected expenses might disturb your financial planning to an extent. Due to hectic work schedules and other commitments, you may be unable to spare enough time for your health hence your fitness level may drop to an extent.\n\nAs you have some excellent favour of Venus and Mercury, your career will get positive momentum during the latter half. Now planetary influences may force you to understand the equations of your relationship in order to raise the level of understanding.\n\nThis may be the right time for you to appear in any competitive exams and chances to excel are bright. The favourable impact of Mercury may help you gain eminence in your career around the month end.\n\nBut some unexpected expenses may also disturb your financial planning, indicates South Node. Venus may bring scopes for a happy encounter with your beloved one.\n\nThings shall be better for your studies but you must try to channelize your energy in right direction in order to achieve your goals. Your better health status might make you somewhat careless about your health which might affect your fitness level to an extent.",
    "aquarius": "As the month begins, the impact of Mars and Mercury foretells happy times for professional activities. If you are in business, the strong cohesive forces of benefic planets will help you sail through some tough situations satisfactorily.\n\nFinances are boosted with the help of family and social connections. But you need to watch for over-sensitive reactions while dealing with some important relationship matters.\n\nThere may be some problems in your studies. A good fitness routine coupled with a good diet plan will help you to maintain your health.\n\nAs the month advances, Jupiter indicates that environment at the workplace will be peaceful and harmonious and you will be able to get things done generally very easily. If you are in business, the mid part of this month is likely to give you some scopes for your progression.\n\nMercury indicates an exceptional week for finances. Jupiter indicates a promising phase for academic growth.\n\nYou may have to face some health problems abruptly around the middle of this month. During the latter half, the impact of Venus may present a delightful picture for professionals.\n\nIf you are contemplating a change of job to improve your career prospects, the period seems auspicious. Investments and speculations may prove beneficial.\n\nThe planets will bring passion and love in your life. But if you want to take up higher education, you may face problems getting into the institutions of your choice.\n\nIf you are suffering from any chronic ailments, such problems will require more attention. As the month approaches its end, the impact of South Node does not promise any bright prospects on the career front this week.\n\nIf you are in business, don’t get lured by short term gains. Whatever defects are there in your financial planning; Saturn will show up.\n\nThis phase may boost your love prospects but, you must keep in mind that some unexpected issues can change the equations of your relationship. The impact of Mercury offers a lot of encouragement for students.\n\nThe impact of South Node suggest that your health will require more care around the month end.",
    "pisces": "As the month begins, Saturn may demand you to work for extended hours to cover up your acquired commitments. Also, emotions are often more volatile.\n\nIf you are in business, the pace of progress is likely to slow down in this phase. Gradually, Jupiter may bring clarity and you may now have the wisdom to implement your financial planning more efficiently.\n\nVenus will bring positivity and optimism in your love life. Mercury will not be so advantageous for your studies and this will make your somewhat lazy.\n\nAs the month advances, Jupiter will help you to think about development and put in action a long-conceived plan for achieving higher growth. Mercury is not very suitable for taking any important decisions related to investments around the mid of this month.\n\nSaturn will require patience as disruptions in your relationship due to ego will be quite possible during this period. Saturn presents a rather not so comfortable health proposition.\n\nSo take better care and go for preventive measures. The latter half k seems good for your career advancement.\n\nHowever, Saturn will require more hard work and systematic planning for the desired success of your work. If you are in business, this can be a good time to coordinate your efforts and direct it towards accomplishments of your pending projects.\n\nVenus will support you hence it is the time to take decisive steps to take your relationship to the next level of harmony and joy. However, your wavering mind may become financially harmful and lead to economic losses so it is necessary to be careful.\n\nAlso, you need to guard your relationship against outside interference around the month end. Mercury will make you receptive and you will find learning much more interesting and easier.\n\nNorth Node indicates a possibility of some minor injury hence need to take adequate precaution and do not do things in a jiffy."
}